In [7]:
import pandas as pd

In [8]:
data = {
    'StudentID': [1, 2, 3, 4, 5],
    'Name': ['Alice', 'Bob', 'Charlie', 'David', 'Eva'],
    'Age': [20, 21, 19, 22, 20],
    'Gender': ['Female', 'Male', 'Male', 'Male', 'Female'],
    'Marks_Math': [85, 76, 90, 65, 95],
    'Marks_English': [88, 72, 85, 70, 92],
    'Attendance': [92, 85, 78, 88, 0]
}

In [9]:
data

{'StudentID': [1, 2, 3, 4, 5],
 'Name': ['Alice', 'Bob', 'Charlie', 'David', 'Eva'],
 'Age': [20, 21, 19, 22, 20],
 'Gender': ['Female', 'Male', 'Male', 'Male', 'Female'],
 'Marks_Math': [85, 76, 90, 65, 95],
 'Marks_English': [88, 72, 85, 70, 92],
 'Attendance': [92, 85, 78, 88, 0]}

In [10]:
df=pd.DataFrame(data)

In [11]:
df

   StudentID     Name  Age  Gender  Marks_Math  Marks_English  Attendance
0          1    Alice   20  Female          85             88          92
1          2      Bob   21    Male          76             72          85
2          3  Charlie   19    Male          90             85          78
3          4    David   22    Male          65             70          88
4          5      Eva   20  Female          95             92           0

In [12]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 7 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   StudentID      5 non-null      int64
 1   Name           5 non-null      object
 2   Age            5 non-null      int64
 3   Gender         5 non-null      object
 4   Marks_Math     5 non-null      int64
 5   Marks_English  5 non-null      int64
 6   Attendance     5 non-null      int64
dtypes: int64(5), object(2)
memory usage: 412.0+ bytes

In [13]:
df.describe()

       StudentID        Age  Marks_Math  Marks_English  Attendance
count   5.000000   5.000000    5.000000       5.000000      5.0000
mean    3.000000  20.400000   82.200000      81.400000     68.6000
std     1.581139   1.140175   11.903781       9.838699     38.6885
min     1.000000  19.000000   65.000000      70.000000      0.0000
25%     2.000000  20.000000   76.000000      72.000000     78.0000
50%     3.000000  20.000000   85.000000      85.000000     85.0000
75%     4.000000  21.000000   90.000000      88.000000     88.0000
max     5.000000  22.000000   95.000000      92.000000     92.0000

In [14]:
df.head(3)

   StudentID     Name  Age  Gender  Marks_Math  Marks_English  Attendance
0          1    Alice   20  Female          85             88          92
1          2      Bob   21    Male          76             72          85
2          3  Charlie   19    Male          90             85          78

In [15]:
df.tail(2)

   StudentID   Name  Age  Gender  Marks_Math  Marks_English  Attendance
3          4  David   22    Male          65             70          88
4          5    Eva   20  Female          95             92           0

In [16]:
df.isnull().sum()

StudentID        0
Name             0
Age              0
Gender           0
Marks_Math       0
Marks_English    0
Attendance       0
dtype: int64

In [17]:
df.isnull()

   StudentID   Name    Age  Gender  Marks_Math  Marks_English  Attendance
0      False  False  False   False       False          False       False
1      False  False  False   False       False          False       False
2      False  False  False   False       False          False       False
3      False  False  False   False       False          False       False
4      False  False  False   False       False          False       False

In [18]:
df.isna().sum()

StudentID        0
Name             0
Age              0
Gender           0
Marks_Math       0
Marks_English    0
Attendance       0
dtype: int64

In [19]:
df1=df[['Age']]

In [20]:
df1

   Age
0   20
1   21
2   19
3   22
4   20

In [21]:
df1=df[['Age','StudentID']]
df1

   Age  StudentID
0   20          1
1   21          2
2   19          3
3   22          4
4   20          5

In [22]:
df1=df[['Age','StudentID','Marks_Math']]
df1

   Age  StudentID  Marks_Math
0   20          1          85
1   21          2          76
2   19          3          90
3   22          4          65
4   20          5          95

In [23]:
columns_to_check=['Age','StudentID','Marks_Math']
df1=df[columns_to_check]
df1

   Age  StudentID  Marks_Math
0   20          1          85
1   21          2          76
2   19          3          90
3   22          4          65
4   20          5          95

In [24]:
len(df['StudentID'].unique())

5

In [25]:
df['StudentID'].unique()

array([1, 2, 3, 4, 5], dtype=int64)

In [26]:
len(df['Name'].unique())

5

In [27]:
df['Name'].unique()

array(['Alice', 'Bob', 'Charlie', 'David', 'Eva'], dtype=object)

In [28]:
features=df.drop(['Age'],axis=1)
features

   StudentID     Name  Gender  Marks_Math  Marks_English  Attendance
0          1    Alice  Female          85             88          92
1          2      Bob    Male          76             72          85
2          3  Charlie    Male          90             85          78
3          4    David    Male          65             70          88
4          5      Eva  Female          95             92           0